app/Controllers/admin/anggota.php

SELECT *
FROM `tbl_anggota`
---
    public function index()
    {
        $anggota = $this->anggotaModels->findAll();