app/Controllers/admin/Buku.php

SELECT *
FROM `tbl_kategori`
---
    public function tambah()
    {
        $data = [
            'Kategori' => $this->kategori->findAll(),
            'Rak' => $this->rak->findAll(),
        ];