app/Controllers/admin/Buku.php

SELECT *
FROM `tbl_buku`
---
    public function index()
    {
        $buku = $this->bukuModels->findAll();

INSERT INTO `tbl_buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `ringkasan_buku`, `jumlah_salinan_tersedia`, `cover_buku`) VALUES ('asdasdasd', 'asdadsas', 'asdasdasd', '1212', 'adasdasd', '24', '2024-01-04.png')
---
                return redirect()->back()->with('errors', 'File sudah di pindahkan!');
            }
        }
        $this->bukuModels->save([
            'judul' => $this->request->getVar('judul_buku'),
            'pengarang'  => $this->request->getVar('pengarang'),
            'penerbit' => $this->request->getVar('penerbit'),
            'tahun_terbit' => $this->request->getVar('tahun_terbit'),
            'ringkasan_buku' => $this->request->getVar('ringkasan_buku'),
            'jumlah_salinan_tersedia' => $this->request->getVar('jumlah_salinan_tersedia'),
            'cover_buku' => $fileName,
        ]);