app/Controllers/Home.php

    public function index()
    {
        $buku = $this->bukuModels->orderBy("tanggal_input_buku", "DESC")->limit(4)->find();
---
SELECT *
FROM `tbl_buku`
ORDER BY `tanggal_input_buku` DESC
 LIMIT 4