app/Models/bukuModels.php

SELECT *
FROM `tbl_buku`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_buku`.`id_kategori`
JOIN `tbl_rak` ON `tbl_rak`.`id_rak` = `tbl_buku`.`id_rak`
---
    public function getData()
    {
        $builder = $this->db->table('tbl_buku');

        $builder->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_buku.id_kategori');
        $query = $builder->get();

SELECT *
FROM `tbl_buku`
WHERE `tbl_buku`.`id_buku` = '5'
---
    public function data_buku($id_buku)
    {
        return $this->find($id_buku);