app/Models/dendaModels.php

SELECT *
FROM `tbl_denda`
WHERE `tbl_denda`.`id_denda` = '2'
---
    public function data_denda($id_denda)
    {
        return $this->find($id_denda);