app/Models/transaksiModels.php

    function getAll()
    {
        $builder = $this->db->table('tbl_transaksi');
        $builder->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_transaksi.id_anggota')
            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_transaksi.id_buku');
        $query = $builder->get();
---
SELECT *
FROM `tbl_transaksi`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_transaksi`.`id_anggota`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_transaksi`.`id_buku`